In [ ]:
%reload_ext sql
%matplotlib inline
import configparser
import os

In [ ]:
import os
import configparser

mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/CSCI3287/home/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")
database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url

In [ ]:
%reload_ext sql
print ("get version...")
%sql SELECT version()

In [ ]:
%%sql
DROP TABLE if EXISTS Pay;

In [ ]:
%%sql
DROP TABLE if EXISTS Employee;

In [ ]:
%%sql
DROP TABLE if EXISTS Store;

In [ ]:
%%sql
DROP TABLE if EXISTS Position;

In [ ]:
%%sql
CREATE TABLE Employee
     (
     emp_id int(11) NOT NULL,
     fullname VARCHAR(30) NOT NULL,
     phone_num VARCHAR(12),
     start_date Date,
     email_address VARCHAR(50),
     position_id int(11) NOT NULL,
     store_id int(11) NOT NULL,
     weekly_hours decimal(3,1) DEFAULT NULL,
     PRIMARY KEY (emp_id),
     FOREIGN KEY (position_id) REFERENCES Position (position_id) ON DELETE CASCADE ON UPDATE CASCADE,
     FOREIGN KEY (store_id) REFERENCES Store (store_id) ON DELETE CASCADE ON UPDATE CASCADE
     );

In [ ]:
%%sql # Insert employees for store # 1
INSERT INTO `Employee` VALUES (1,'Grant Hargrave','9523939649','2020-11-11','granthargrav@gmail.com',2,1,35.0);
INSERT INTO `Employee` VALUES (2,'Lawrence Byrd','2826068703','2020-03-02','LawrenceByrd@gmail.com',1,1,34.0);
INSERT INTO `Employee` VALUES (3,'Tyrone Deleon','7519900398','2021-01-15','TyroneDeleon@gmail.com',3,1,13.0);
INSERT INTO `Employee` VALUES (4,'Maribel Osborn','5018632139','2020-11-06','MaribelOsborn@gmail.com',3,1,33.0);
INSERT INTO `Employee` VALUES (5,'Natalie Pierce','5464025043','2019-10-10','NataliePierce@gmail.com',3,1,42.0);
INSERT INTO `Employee` VALUES (6,'Dalia Santiago','9394118138','2022-12-02','DaliaSantiago@gmail.com',3,1,21.0);
INSERT INTO `Employee` VALUES (7,'Anahi Marks','7672881161','2020-05-02','AnahiMarks@gmail.com',3,1,19.0);
INSERT INTO `Employee` VALUES (8,'Danika Olsen','9159706547','2021-01-02','DanikaOlsen@gmail.com',3,1,7.0);
INSERT INTO `Employee` VALUES (9,'Coby Chaney','8249391666','2021-07-07','CobyChaney@gmail.com',3,1,19.0);
INSERT INTO `Employee` VALUES (10,'Kyler Rubio','7669510852','2021-12-02','KylerRubio@gmail.com',3,1,6.0);

In [ ]:
%%sql # Insert employees for store # 2
INSERT INTO `Employee` VALUES (11,'Zackary Mueller','3952194679','2020-03-02','ZackaryMueller@gmail.com',1,2,21.0);
INSERT INTO `Employee` VALUES (12,'Antwan Mcdaniel','4694040511','2021-01-15','AntwanMcdaniel@gmail.com',2,2,19.0);
INSERT INTO `Employee` VALUES (13,'Davian Prince','5438001987','2020-11-06','DavianPrince@gmail.com',3,2,7.0);
INSERT INTO `Employee` VALUES (14,'Jayden Baird','2295542612','2019-10-10','JaydenBaird@gmail.com',3,2,19.0);
INSERT INTO `Employee` VALUES (15,'Elliana Moon','8592336949','2022-12-02','EllianaMoon@gmail.com',3,2,6.0);
INSERT INTO `Employee` VALUES (16,'Moshe Parker','7856087481','2020-05-02','MosheParker@gmail.com',3,2,42.0);
INSERT INTO `Employee` VALUES (17,'Leia Jacobs','4059470965','2021-01-02','LeiaJacobs@gmail.com',3,2,33.0);
INSERT INTO `Employee` VALUES (18,'Shirley Mcclain','5415730778','2021-07-07','ShirleyMcclain@gmail.com',3,2,13.0);
INSERT INTO `Employee` VALUES (19,'Katherine Brown','4383554391','2021-12-02','KatherineBrown@gmail.com',3,2,34.0);
INSERT INTO `Employee` VALUES (20,'Rachael Rich','2284384810','2020-01-01','RachaelRich@gmail.com',3,2,35.0);

In [ ]:
%%sql
INSERT INTO `Employee` VALUES (31,'Katyln Brown','4383554391','2021-12-02','KatylnBrown@gmail.com',3,2,5.0);
INSERT INTO `Employee` VALUES (32,'Roddy Rich','2284384810','2021-12-02','RoddyRich@gmail.com',3,2,5.0);

In [ ]:
%%sql # Insert employees for store # 3
INSERT INTO `Employee` VALUES (21,'Cassie Pratt','7324981220','2020-03-02','CassiePratt@gmail.com',1,3,19.0);
INSERT INTO `Employee` VALUES (22,'Nayeli Riddle','9574321580','2021-01-15','NayeliRiddle@gmail.com',2,3,34.0);
INSERT INTO `Employee` VALUES (23,'Damaris Farrell','2208463556','2020-11-06','DamarisFarrell@gmail.com',3,3,21.0);
INSERT INTO `Employee` VALUES (24,'Sanaa Morales','7868242764','2019-10-10','SanaaMoralesd@gmail.com',3,3,35.0);
INSERT INTO `Employee` VALUES (25,'Brandon Moody','8714687325','2022-12-02','BrandonMoody@gmail.com',3,3,13.0);
INSERT INTO `Employee` VALUES (26,'Savanna Velez','4884216267','2020-05-02','SavannaVelez@gmail.com',3,3,33.0);
INSERT INTO `Employee` VALUES (27,'Janiya Cannon','9827173628','2021-01-02','Janiya Cannon@gmail.com',3,3,42.0);
INSERT INTO `Employee` VALUES (28,'Kailey Joseph','8786821003','2021-07-07','KaileyJoseph@gmail.com',3,3,6.0);
INSERT INTO `Employee` VALUES (29,'Rodney Diaz','2523284612','2021-12-02','RodneyDiaz@gmail.com',3,3,19.0);
INSERT INTO `Employee` VALUES (30,'Dakota Greer','7846639191','2021-12-02','DakotaGreer@gmail.com',3,3,7.0);

In [ ]:
%%sql
INSERT INTO `Employee` VALUES (33,'Jack Cannon','9827175678','2019-01-02','Janiya Cannon@gmail.com',3,2,42.0);

In [ ]:
%%sql # Table for holding information for calculating salary DELETES ON DELETION OF KEY emp_id
CREATE TABLE Pay
    (
        emp_id int(11) NOT NULL, 
        pay_rate decimal(4,2) NOT NULL, 
        days_missed int(20) DEFAULT NULL,
        KEY (emp_id),
        FOREIGN KEY (emp_id) REFERENCES Employee (emp_id) ON DELETE CASCADE ON UPDATE CASCADE
    );

In [ ]:
%%sql # Insert statements for pay table 
INSERT INTO Pay VALUES (1,18.0,2);
INSERT INTO Pay VALUES (2,22.0,0);
INSERT INTO Pay VALUES (3,13.5,0);
INSERT INTO Pay VALUES (4,13.5,0);
INSERT INTO Pay VALUES (5,13.5,0);
INSERT INTO Pay VALUES (6,13.5,0);
INSERT INTO Pay VALUES (7,13.5,0);
INSERT INTO Pay VALUES (8,13.5,0);
INSERT INTO Pay VALUES (9,13.5,0);
INSERT INTO Pay VALUES (10,13.5,0);
INSERT INTO Pay VALUES (11,13.5,0);
INSERT INTO Pay VALUES (12,13.5,0);
INSERT INTO Pay VALUES (13,13.5,0);
INSERT INTO Pay VALUES (14,13.5,0);
INSERT INTO Pay VALUES (15,13.5,0);
INSERT INTO Pay VALUES (16,13.5,0);
INSERT INTO Pay VALUES (17,13.5,0);
INSERT INTO Pay VALUES (18,13.5,0);
INSERT INTO Pay VALUES (19,13.5,0);
INSERT INTO Pay VALUES (20,13.5,0);
INSERT INTO Pay VALUES (21,13.5,0);
INSERT INTO Pay VALUES (22,13.5,0);
INSERT INTO Pay VALUES (23,13.5,0);
INSERT INTO Pay VALUES (24,13.5,0);
INSERT INTO Pay VALUES (25,13.5,0);
INSERT INTO Pay VALUES (26,13.5,0);
INSERT INTO Pay VALUES (27,13.5,0);
INSERT INTO Pay VALUES (28,13.5,0);
INSERT INTO Pay VALUES (29,13.5,0);
INSERT INTO Pay VALUES (30,13.5,0);

In [ ]:
%%sql
INSERT INTO Pay VALUES (31,14.0,0);
INSERT INTO Pay VALUES (32,14.5,1);
INSERT INTO Pay VALUES (33,16.5,3);

In [ ]:
%sql INSERT INTO Pay VALUES (1,18.0,2);

In [ ]:
%%sql # Initialize store table 
CREATE TABLE Store
    (
        store_id int(11) NOT NULL,
        address VARCHAR(50) NOT NULL,
        city VARCHAR(50) NOT NULL,
        state_code VARCHAR(2) NOT NULL,
        PRIMARY KEY (store_id)
    );

In [ ]:
%%sql # Inserts values into store table 
INSERT INTO Store VALUES (1,'1326 Pearl St','Boulder','CO');
INSERT INTO Store VALUES (2,'19885 Chartwell Hill','Minnetonka','MN');
INSERT INTO Store VALUES (3,'1555 Broadway St','Madison','WI');

In [ ]:
%%sql # Initialize position table 
CREATE TABLE Position
    (
        position_id int(11) NOT NULL,
        position_name VARCHAR(30) NOT NULL,
        store_id int(11) NOT NULL,
        PRIMARY KEY (position_id, store_id),
        FOREIGN KEY (store_id) REFERENCES Store (store_id) ON DELETE CASCADE ON UPDATE CASCADE
    );

In [ ]:
%%sql # Inserts values into position table 
INSERT INTO Position VALUES (1,'Owner',1);
INSERT INTO Position VALUES (2,'Manager',1);
INSERT INTO Position VALUES (3,'Sales Associate',1);
INSERT INTO Position VALUES (1,'Owner',2);
INSERT INTO Position VALUES (2,'Manager',2);
INSERT INTO Position VALUES (3,'Sales Associate',2);
INSERT INTO Position VALUES (1,'Owner',3);
INSERT INTO Position VALUES (2,'Manager',3);
INSERT INTO Position VALUES (3,'Sales Associate',3);

In [38]:
%%sql
SELECT * 
FROM Employee

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
32 rows affected.

[(1, 'Grant Hargrave', '9523939649', datetime.date(2020, 11, 11), 'granthargrav@gmail.com', 2, 1, Decimal('35.0')),
 (2, 'Lawrence Byrd', '2826068703', datetime.date(2020, 3, 2), 'LawrenceByrd@gmail.com', 1, 1, Decimal('34.0')),
 (3, 'Tyrone Deleon', '7519900398', datetime.date(2021, 1, 15), 'TyroneDeleon@gmail.com', 3, 1, Decimal('13.0')),
 (4, 'Maribel Osborn', '5018632139', datetime.date(2020, 11, 6), 'MaribelOsborn@gmail.com', 3, 1, Decimal('33.0')),
 (5, 'Natalie Pierce', '5464025043', datetime.date(2019, 10, 10), 'NataliePierce@gmail.com', 3, 1, Decimal('42.0')),
 (6, 'Dalia Santiago', '9394118138', datetime.date(2022, 12, 2), 'DaliaSantiago@gmail.com', 3, 1, Decimal('21.0')),
 (7, 'Anahi Marks', '7672881161', datetime.date(2020, 5, 2), 'AnahiMarks@gmail.com', 3, 1, Decimal('19.0')),
 (8, 'Danika Olsen', '9159706547', datetime.date(2021, 1, 2), 'DanikaOlsen@gmail.com', 3, 1, Decimal('7.0')),
 (9, 'Coby Chaney', '8249391666', datetime.date(2021, 7, 7), 'CobyChaney@gmail.com', 3, 1, Decimal('19.0')),
 (10, 'Kyler Rubio', '7669510852', datetime.date(2021, 12, 2), 'KylerRubio@gmail.com', 3, 1, Decimal('6.0')),
 (11, 'Zackary Mueller', '3952194679', datetime.date(2020, 3, 2), 'ZackaryMueller@gmail.com', 1, 2, Decimal('21.0')),
 (12, 'Antwan Mcdaniel', '4694040511', datetime.date(2021, 1, 15), 'AntwanMcdaniel@gmail.com', 2, 2, Decimal('19.0')),
 (13, 'Davian Prince', '5438001987', datetime.date(2020, 11, 6), 'DavianPrince@gmail.com', 3, 2, Decimal('7.0')),
 (14, 'Jayden Baird', '2295542612', datetime.date(2019, 10, 10), 'JaydenBaird@gmail.com', 3, 2, Decimal('19.0')),
 (15, 'Elliana Moon', '8592336949', datetime.date(2022, 12, 2), 'EllianaMoon@gmail.com', 3, 2, Decimal('6.0')),
 (16, 'Moshe Parker', '7856087481', datetime.date(2020, 5, 2), 'MosheParker@gmail.com', 3, 2, Decimal('42.0')),
 (17, 'Leia Jacobs', '4059470965', datetime.date(2021, 1, 2), 'LeiaJacobs@gmail.com', 3, 2, Decimal('33.0')),
 (18, 'Shirley Mcclain', '5415730778', datetime.date(2021, 7, 7), 'ShirleyMcclain@gmail.com', 3, 2, Decimal('13.0')),
 (19, 'Katherine Brown', '4383554391', datetime.date(2021, 12, 2), 'KatherineBrown@gmail.com', 3, 2, Decimal('34.0')),
 (20, 'Rachael Rich', '2284384810', datetime.date(2020, 1, 1), 'RachaelRich@gmail.com', 3, 2, Decimal('35.0')),
 (21, 'Cassie Pratt', '7324981220', datetime.date(2020, 3, 2), 'CassiePratt@gmail.com', 1, 3, Decimal('19.0')),
 (22, 'Nayeli Riddle', '9574321580', datetime.date(2021, 1, 15), 'NayeliRiddle@gmail.com', 2, 3, Decimal('34.0')),
 (23, 'Damaris Farrell', '2208463556', datetime.date(2020, 11, 6), 'DamarisFarrell@gmail.com', 3, 3, Decimal('21.0')),
 (24, 'Sanaa Morales', '7868242764', datetime.date(2019, 10, 10), 'SanaaMoralesd@gmail.com', 3, 3, Decimal('35.0')),
 (25, 'Brandon Moody', '8714687325', datetime.date(2022, 12, 2), 'BrandonMoody@gmail.com', 3, 3, Decimal('13.0')),
 (26, 'Savanna Velez', '4884216267', datetime.date(2020, 5, 2), 'SavannaVelez@gmail.com', 3, 3, Decimal('33.0')),
 (27, 'Janiya Cannon', '9827173628', datetime.date(2021, 1, 2), 'Janiya Cannon@gmail.com', 3, 3, Decimal('42.0')),
 (28, 'Kailey Joseph', '8786821003', datetime.date(2021, 7, 7), 'KaileyJoseph@gmail.com', 3, 3, Decimal('6.0')),
 (29, 'Rodney Diaz', '2523284612', datetime.date(2021, 12, 2), 'RodneyDiaz@gmail.com', 3, 3, Decimal('19.0')),
 (30, 'Dakota Greer', '7846639191', datetime.date(2021, 12, 2), 'DakotaGreer@gmail.com', 3, 3, Decimal('7.0')),
 (31, 'Katyln Brown', '4383554391', datetime.date(2021, 12, 2), 'KatylnBrown@gmail.com', 3, 2, Decimal('5.0')),
 (32, 'Roddy Rich', '2284384810', datetime.date(2021, 12, 2), 'RoddyRich@gmail.com', 3, 2, Decimal('5.0'))]

In [39]:
%%sql
SELECT * 
FROM Pay

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
32 rows affected.

[(31, Decimal('14.00'), 0),
 (32, Decimal('14.50'), 1),
 (1, Decimal('18.00'), 2),
 (2, Decimal('22.00'), 0),
 (3, Decimal('13.50'), 0),
 (4, Decimal('13.50'), 0),
 (5, Decimal('13.50'), 0),
 (6, Decimal('13.50'), 0),
 (7, Decimal('13.50'), 0),
 (8, Decimal('13.50'), 0),
 (9, Decimal('13.50'), 0),
 (10, Decimal('13.50'), 0),
 (11, Decimal('13.50'), 0),
 (12, Decimal('13.50'), 0),
 (13, Decimal('13.50'), 0),
 (14, Decimal('13.50'), 0),
 (15, Decimal('13.50'), 0),
 (16, Decimal('13.50'), 0),
 (17, Decimal('13.50'), 0),
 (18, Decimal('13.50'), 0),
 (19, Decimal('13.50'), 0),
 (20, Decimal('13.50'), 0),
 (21, Decimal('13.50'), 0),
 (22, Decimal('13.50'), 0),
 (23, Decimal('13.50'), 0),
 (24, Decimal('13.50'), 0),
 (25, Decimal('13.50'), 0),
 (26, Decimal('13.50'), 0),
 (27, Decimal('13.50'), 0),
 (28, Decimal('13.50'), 0),
 (29, Decimal('13.50'), 0),
 (30, Decimal('13.50'), 0)]

In [40]:
%%sql
SELECT * 
FROM Position

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
9 rows affected.

[(1, 'Owner', 1),
 (1, 'Owner', 2),
 (1, 'Owner', 3),
 (2, 'Manager', 1),
 (2, 'Manager', 2),
 (2, 'Manager', 3),
 (3, 'Sales Associate', 1),
 (3, 'Sales Associate', 2),
 (3, 'Sales Associate', 3)]

In [41]:
%%sql
SELECT * 
FROM Store

 * mysql://grha8384:***@applied-sql.cs.colorado.edu:3306/grha8384
3 rows affected.

[(1, '1326 Pearl St', 'Boulder', 'CO'),
 (2, '19885 Chartwell Hill', 'Minnetonka', 'MN'),
 (3, '1555 Broadway St', 'Madison', 'WI')]